; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 46668 2 1 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation7 - direction
	Star4 - direction
	Star6 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star12)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image1)
	(have_image Star10 thermograph0)
	(have_image Star11 image1)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   goals met: 0 of 8
3. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 8
4. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 1 of 8
5. (turn_to satellite1 star12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star12)
   goals met: 2 of 8
6. (take_image satellite1 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 3 of 8
7. (turn_to satellite1 star11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star11)
   goals met: 2 of 8
8. (take_image satellite1 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 3 of 8
9. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 4 of 8
10. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 3 of 8
11. (take_image satellite1 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 4 of 8
12. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 5 of 8
13. (turn_to satellite1 planet9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet9)
   goals met: 4 of 8
14. (take_image satellite1 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 5 of 8
15. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 6 of 8
16. (turn_to satellite1 phenomenon8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 8
17. (take_image satellite1 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 6 of 8
18. (turn_to satellite1 star12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star12)
   goals met: 7 of 8
19. (turn_to satellite1 phenomenon13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 8
20. (take_image satellite1 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 7 of 8
21. (turn_to satellite1 star12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star12)
   goals met: 8 of 8
